app/views/rooms/active.html.erb

SELECT "rounds".* FROM "rounds" WHERE "rounds"."room_id" = $1 ORDER BY "rounds"."created_at" DESC LIMIT $2  [["room_id", 1], ["LIMIT", 1]]
---
    <% @rooms.each do |room|
    round = Round.where(room_id: room.id).order(:created_at).last