app/views/rooms/open.html.erb

          <div class="info">
            <span class="player-info">Player: <%= RoomUser.where(room_id: room.id ,alive: true).count %></span>
---
SELECT COUNT(*) FROM "room_users" WHERE "room_users"."room_id" = $1 AND "room_users"."alive" = $2  [["room_id", 1], ["alive", true]]