app/controllers/home_controller.rb

    def index
      if(current_user)
        current_user.balance = 1000
        current_user.game_wins = 0
        current_user.games_played = 0
        current_user.rounds_played = 0
        current_user.round_wins = 0
        current_user.save
---
UPDATE "users" SET "game_wins" = $1, "games_played" = $2, "rounds_played" = $3, "round_wins" = $4, "balance" = $5 WHERE "users"."id" = $6  [["game_wins", "0.0"], ["games_played", "0.0"], ["rounds_played", "0.0"], ["round_wins", "0.0"], ["balance", "1000.0"], ["id", 3]]