app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms" INNER JOIN room_users ON room_users.room_id = rooms.id AND room_users.user_id = 8 AND rooms.active = true AND room_users.alive = true AND rooms.finished = false
---
  def active
    @rooms = Room.joins("INNER JOIN room_users ON room_users.room_id = rooms.id AND room_users.user_id = #{current_user.id} AND rooms.active = true AND room_users.alive = true AND rooms.finished = false")

SELECT "rooms".* FROM "rooms" WHERE "rooms"."active" = $1  [["active", false]]
---
  def open
    @rooms = Room.where(active: false)

INSERT INTO "rooms" ("prizepool", "finished", "active", "x_color", "o_color", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["prizepool", "1000.0"], ["finished", false], ["active", false], ["x_color", nil], ["o_color", nil], ["created_at", "2023-02-05 11:41:00.513989"], ["updated_at", "2023-02-05 11:41:00.513989"]]
---
  def create
    @room = Room.new(active: false,prizepool: 1000, finished: false)
    if @room.save

SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "rooms" SET "active" = $1, "updated_at" = $2 WHERE "rooms"."id" = $3  [["active", true], ["updated_at", "2023-02-05 11:41:01.708334"], ["id", 2]]
INSERT INTO "room_users" ("user_id", "room_id", "alive", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 12], ["room_id", 2], ["alive", true], ["created_at", "2023-02-05 11:41:01.746713"], ["updated_at", "2023-02-05 11:41:01.746713"]]
UPDATE "users" SET "balance" = $1 WHERE "users"."id" = $2  [["balance", "990.0"], ["id", 12]]
---
  def join
      room = Room.find(params[:id])
      room.active = true
      room.save
      current_user.balance -= 10
      current_user.save
      RoomUser.create(room_id: room.id, user_id: current_user.id, alive: true)